Repository: egold-group/padavan-egold
Catalog: trunk/user/firefly/*-daapd-code/osx/FireflyPrefs/i18n/*/FireflyPrefsPref_nib.strings
Languages: dutch, italian

source: (available when Firefly is running)
dutch: (beschikbaar als Firefly aktief is)
italian: (disponibile quando Firefly è avviato)

source: << do not localize >>
dutch: << niet localizeren >>

source: <unknown>
dutch: <onbekend>

source: Additional configuration options are available from Firefly's built-in web page. Available when Firefly is running.
dutch: Uitgebreide configuratie opties zijn beschikbaar via Firefly's ingebouwde web pagina. Available when Firefly is running.
italian: Ulteriori opzioni di configurazione sono disponibili nella pagina web di controllo di Firefly (disponibile solo quando Firefly è avviato).

source: Advanced
dutch: Uitgebreid
italian: Avanzata

source: Apply Now
dutch: Aanbrengen
italian: Applica

source: Assign Server Port:
dutch: toekennen Server Poort:
italian: Imposta la porta per il server:

source: Automatically
dutch: Automatisch
italian: Automaticamente

source: Automatically, when I log in
dutch: Automatisch, als ik aanlog
italian: Automaticamente, durante il login

source: Browse...
dutch: Bladeren...
italian: Sfoglia...

source: Firefly Server Version:
dutch: Firefly Server Versie:
italian: Versione di Firefly Server:

source: Firefly is disabled
dutch: Firefly is uitgeschakeld
italian: Firefly è disattivato

source: General
dutch: Algemeen
italian: Generale

source: Library Location:
dutch: Plaats van de Bibliotheek:
italian: Ubicazione della libreria:

source: Manually
dutch: Handmatig
italian: Manuale

source: Open Web Page
dutch: Open Web Pagina
italian: Apri la pagina web

source: OtherViews
dutch: Andere mogelijkheden

source: Prefs Panel Version:
dutch: Prefs Panel Versie:
italian: Versione del pannello di controllo:

source: Require Password:
dutch: Password verplicht:
italian: Richiedi Password:

source: Shared Name:
dutch: Naam van de Share:
italian: Nome condiviso:

source: Show Firefly menu in menu bar
dutch: Toon Firefly menu in menu balk
italian: Mostra il menu di Firefly nella barra dei menu

source: The Firefly music server shares your music library with other computers and compatible devices on the local network.
dutch: De Firefly muziek server shared je muziek bibliotheek met andere computers en compatible aparaten op het locale netwerk.
italian: Il server di musica Firefly condivide la tua libreria musicale con altri computers e lettori compatibili che si trovano sulla rete locale.

source: Start Firefly
italian: Avvia Firefly

source: Start server:
italian: Avvia il server:
