Repository: egold-group/padavan-egold
Catalog: trunk/user/firefly/*-daapd-code/osx/FireflyPrefs/i18n/*/Localizable.strings
Languages: french

source: %@'s Firefly on %@
french: %1$@ de Firefly sur %2$@

source: (available when Firefly is running)
french: (disponible lorsque Firefly est démarré)

source: Additional configuration options are available from Firefly's built-in web page. Available when Firefly is running.
french: D'autres options de configuration additionnelles sont disponible depuis la page Web incluse dans Firefly. Disponible lorsque Firefly est démarré.

source: Additional configuration options are available from Firefly's built-in web page. Click to open the page in your browser.
french: D'autres options de configuration additionnelles sont disponible depuis la page Web incluse dans Firefly. Cliquez pour ouvrir la page dans votre navigateur.

source: An unexpected error occurred when trying to get the status of the Firefly server. Please close and re-open this Preference pane, and try again.
french: Une erreur inattendue s'est produite pendant l'obtention du status du serveur Firefly. Veuillez fermer puis ré-ouvrir cette Préférence, et essayez à nouveau.

source: An unexpected error occurred when trying to start Firefly. Please close and re-open this Preference pane, and try again.
french: Une erreur inattendue s'est produite pendant le démarrage de Firefly. Veuillez fermer puis ré-ouvrir cette Préférence, et essayez à nouveau.

source: An unexpected error occurred when trying to stop Firefly. Please close and re-open this Preference pane, and try again.
french: Une erreur inattendue s'est produite pendant l'arrêt de Firefly. Veuillez fermer puis ré-ouvrir cette Préférence, et essayez à nouveau.

source: Apply
french: Appliquer

source: Apply configuration changes?
french: Appliquer les changements de configuration?

source: Cancel
french: Annuler

source: Checking Firefly status…
french: Vérification du status de Firefly…

source: Choose
french: Choisissez

source: Choose Library Location
french: Choisissez l'emplacement de la bibliothèque

source: Communication has been lost with the Firefly Helper. Please close and re-open this Preference pane, and try again.
french: La communication avec l'Aide Firefly a été perdue. Veuillez fermer puis ré-ouvrir cette Préférence, et essayez à nouveau.

source: Configuration error
french: Erreur de configuration

source: Don't Apply
french: Ne pas appliquer

source: Due to an unexpected error, your changes could not be applied.
french: Dû à une erreur inatendue, vos changements n'ont pas pu être appliquées.

source: Failed to apply changes
french: Impossible d'appliquer les changements

source: Failed to save changes
french: Impossible de sauver les changements

source: Firefly appears to be incorrectly installed or damaged. Please consult the documentation.
french: Firefly semble être incorrectement installé ou endommagé. Veuillez consulter la documentation.

source: Firefly could not be started because your changes could not be saved
french: Firefly peut ne pas démarrer parce que vos changements peuvent ne pas être sauvés

source: Firefly directory could not be found or created at: %@
french: Le répertoire de Firefly ne peut être trouvé ou crée sur: %@

source: Firefly failed to start
french: Firefly n'a pas pu démarrer

source: Firefly is not running
french: Firefly n'est pas démarré

source: Firefly is restarting
french: Firefly redémarre

source: Firefly is running
french: Firefly est démarré

source: Firefly is scanning the library
french: Firefly parcours la bibliothèque

source: Firefly is starting
french: Firefly démarre

source: Firefly is stopping
french: Firefly est arrêté

source: Firefly status is unknown
french: Le status de Firefly est inconnu

source: Firefly stopped unexpectedly
french: Firefly s'est arrêté inopinément

source: Invalid port number
french: Numéro de port Invalide

source: Invalid value
french: Valeur invalide

source: Library directory could not be found in user folder
french: Le répertoire contenant la bibliothèque n'a pas pu être trouvé dans le répertoire utilisateur

source: Lost contact with Firefly Helper
french: Perte de contact avec l'Aide de Firefly

source: Missing library name
french: Nom de bibliothèque manquant

source: Missing password
french: Mot de passe manquant

source: Please enter a library name
french: Veuillez entrer un nom de bibliothèque

source: Please enter a password, or un-check the password checkbox
french: Veuillez entrer un mot de passe, ou déselectionnez la checkbox du mot de passe

source: Please enter a port number between 1024 and 65535, or choose "Automatic" from the pop-up menu
french: Veuillez entrer un numéro de port entre 1024 et 65535, ou choisissez "Automatic" depuis le menu pop-up

source: Please select the folder containing your music library, then click Choose.
french: Veuillez sélectionner le dossier contennant votre bibliothèque musicale, puis cliquez sur Choisir.

source: Start Firefly
french: Démarrer Firefly

source: Stop Firefly
french: Arrêter Firefly

source: The configuration file is present, but is not writable: %@
french: Le fichier de configuration est présent, mais est protégé en écriture: %@

source: The Firefly installation appears to be damaged. Unable to locate Firefly Helper.
french: L'installation de Firefly semble endommagée. Impossible de localiser l'Aide de Firefly.

source: The log file has not been created.
french: Le fichier de log n'a pas été crée.

source: The log file is empty.
french: Le fichier de log est vide.

source: Unable to create a default configuration file at: %@
french: impossible de créer un fichier de configuraion par défaut sur: %@

source: Unable to find or create Application Support folder
french: Impossible de trouver ou de créer le dossier de support de l'application

source: Unable to get server status
french: Impossible d'obtenir le status du serveur

source: Unable to read configuration information
french: impossible de lire les informations de configuration information

source: Unable to start Firefly
french: Impossible de démarrer Firefly

source: Unable to stop Firefly
french: Impossible d'arrêter Firefly
