Repository: egold-group/padavan-egold
Catalog: trunk/user/firefly/*-daapd-code/osx/FireflyPrefs/i18n/*.strings
Languages: german

source: Firefly is not running
german: Firefly ist nicht gestartet

source: Please enter a port number between 1024 and 65535, or choose "Automatic" from the pop-up menu
german: Bitte wählen Sie eine Portnummer zwischen 1024 und 65535, oder wählen Sie "Automatisch" aus dem Menü

source: Show Firefly menu in menu bar
german: Firefly Menü in der Menüleiste anzeigen

source: Shared Name:
german: Freigabename:

source: Missing password
german: Passwort fehlt

source: Firefly is stopping
german: Firefly wird beendet

source: Cancel
german: Abbrechen

source: Unable to read configuration information
german: Fehler beim Lesen der Konfigurationsdatei

source: Open Web Page
german: Website öffnen

source: Firefly is scanning the library
german: Firefly durchsucht die Musikbibliothek

source: Unable to create a default configuration file at: %@
german: Fehler beim erstellen der Standardkonfiguration in: %@

source: Failed to apply changes
german: Fehler beim Übernehmen der Änderungen

source: Firefly is restarting
german: Firefly wird neu gestartet

source: Additional configuration options are available from Firefly's built-in web page. Click to open the page in your browser.
german: Erweiterte Konfigurationsmöglichkeiten gibt es auf der eingebauten Website von Firefly. Klicken Sie um diese Site in Ihrem Browser zu öffnen.

source: Please select the folder containing your music library, then click Choose.
german: Wählen Sie den Ordner, der Ihre Musik enthält. Drücken Sie dann Auswählen.

source: Invalid port number
german: Ungültige Portnummer

source: Browse...
german: Durchsuchen...

source: Library Location:
german: Pfad zur Bibliothek

source: Checking Firefly status…
german: Überprüfe Status von Firefly…

source: The log file has not been created.
german: Eine Logdatei existiert nicht.

source: Missing library name
german: Bibliothekname fehlt

source: An unexpected error occurred when trying to get the status of the Firefly server. Please close and re-open this Preference pane, and try again.
german: Ein unbekannter Fehler ist aufgetreten. Der Status von Firefly ist unbekannt. Bitte schliessen Sie dieses Fenster und versuchen Sie es erneut.

source: Unable to find or create Application Support folder
german: Kann Anwendungsdaten-Ordner nicht finden

source: Please enter a library name
german: Bitte geben Sie einen Namen der Bibliothek ein

source: Due to an unexpected error, your changes could not be applied.
german: Aufgrund eines Fehlers konnten die Änderungen nicht übernommen werden.

source: Firefly status is unknown
german: Der Status von Firefly ist unbekannt

source: Apply Now
german: Übernehmen

source: An unexpected error occurred when trying to stop Firefly. Please close and re-open this Preference pane, and try again.
german: Ein Fehler ist aufgetreten. Firefly konnte nicht beendet werden. Bitte schliessen Sie dieses Fenster, und versuchen Sie es erneut.

source: Start server:
german: Server starten:

source: Unable to stop Firefly
german: Firefly konnte nicht beendet werden

source: Library directory could not be found in user folder
german: Die Bibliothek konnte nicht im Benutzerordner gefunden werden.

source: Invalid value
german: Ungültiger Wert

source: Please enter a password, or un-check the password checkbox
german: Geben Sie ein Passwort ein, oder entfernen Sie das Häkchen

source: Configuration error
german: Fehler beim Konfigurieren

source: Communication has been lost with the Firefly Helper. Please close and re-open this Preference pane, and try again.
german: Die Verbindung zum Firefly Helfer wurde verloren. Schliessen Sie dieses Fenster und versuchen Sie es erneut.

source: Don't Apply
german: Nicht übernehmen

source: Firefly is running
german: Firefly ist gestartet

source: The Firefly installation appears to be damaged. Unable to locate Firefly Helper.
german: Die Firefly Installation scheint fehlerhaft zu sein. Kann Firefly Helfer nicht finden.

source: General
german: Allgemein

source: Advanced
german: Erweitert

source: Lost contact with Firefly Helper
german: Verbindung zum Firefly Helfer verloren

source: Manually
german: Manuell

source: Firefly appears to be incorrectly installed or damaged. Please consult the documentation.
german: Firefly ist fehlerhaft installiert oder beschädigt. Bitte lesen Sie die Dokumentation.

source: An unexpected error occurred when trying to start Firefly. Please close and re-open this Preference pane, and try again.
german: in Fehler ist aufgetreten. Firefly konnte nicht gestartet werden. Bitte schliessen Sie dieses Fenster, und versuchen Sie es erneut.

source: Firefly is starting
german: Firefly wird gestartet

source: Failed to save changes
german: Fehler beim Speichern

source: Choose Library Location
german: Wählen Sie den Ort der Bibliothek

source: Unable to get server status
german: Fehler beim Überprüfen des Status von Firefly

source: Automatically, when I log in
german: Automatisch, bei der Anmeldung

source: The configuration file is present, but is not writable: %@
german: Die Konfigurationsdatei ist vorhanden, aber schreibgeschützt: %@

source: The Firefly music server shares your music library with other computers and compatible devices on the local network.
german: Der Firefly Musik Server kann Ihre Musik mit anderen Computern und anderen kompatiblen Geräten im Netzwerk freigeben.

source: Stop Firefly
german: Firefly beenden

source: Start Firefly
german: Firefly starten

source: Assign Server Port:
german: Portnummer zuweisen:

source: The log file is empty.
german: Die Logdatei ist leer.

source: Firefly could not be started because your changes could not be saved
german: Firefly konnte nicht gestartet werden weil die Änderungen nicht gespeichert werden konnten.

source: Firefly failed to start
german: Starten von Firefly fehlgeschlagen

source: Firefly is disabled
german: Firefly ist deaktiviert

source: <unknown>
german: <unbekannt>

source: (available when Firefly is running)
german: (verfügbar wenn Firefly gestartet ist)

source: Apply
german: Übernehmen

source: Firefly directory could not be found or created at: %@
german: Firefly-Ordner konnte nicht gefunden bzw. erstellt werden: %@

source: Unable to start Firefly
german: Fehler beim Starten von Firefly

source: Additional configuration options are available from Firefly's built-in web page. Available when Firefly is running.
german: Erweiterte Konfigurationsmöglichkeiten befinden sich auf der eingebauten Firefly Website. Sie ist verfügbar, wenn Firefly gestartet wurde.

source: Firefly stopped unexpectedly
german: Firefly wurde unerwartet beendet

source: Automatically
german: Automatisch

source: Choose
german: Auswählen

source: Apply configuration changes?
german: Änderungen übernehmen?

source: Require Password:
german: Benötigt Passwort:

source: %@'s Firefly on %@
german: %1$@'s Firefly auf %2$@

source: NSHumanReadableCopyright
german: © 2006 Roku LLC
