Repository: egold-group/padavan-egold
Catalog: trunk/user/firefly/*-daapd-code/osx/FireflyPrefs/i18n/Swedish.strings
Languages: mt

source: Firefly is not running
mt: Firefly är inte aktivt

source: Please enter a port number between 1024 and 65535, or choose "Automatic" from the pop-up menu
mt: Ange ett port nummer mellan 1024 och 65535, eller välj "Automatisk" från pop-up menyn

source: Show Firefly menu in menu bar
mt: Visa Firefly status i menyraden

source: Shared Name:
mt: Delat Namn:

source: Missing password
mt: Lösenord saknas

source: Firefly is stopping
mt: Firefly stoppas

source: Cancel
mt: Avbryt

source: Unable to read configuration information
mt: Kan inte läsa konfigurationen

source: Open Web Page
mt: Öppna Webbsida

source: Firefly is scanning the library
mt: Firefly söker igenom biblioteket

source: Unable to create a default configuration file at: %@
mt: Kunde inte skapa en standard konfigutaions fil i: %@

source: Prefs Panel Version:
mt: Inställningspanelens version:

source: Firefly Server Version:
mt: Firefly serverns version:

source: Failed to apply changes
mt: Kunde inte utföra ändringarna

source: Firefly is restarting
mt: Firefly startar om

source: Additional configuration options are available from Firefly's built-in web page. Click to open the page in your browser.
mt: Fler konfigurations alternativ är tillgängliga via Firefly’s inbyggde webb sida. Klicka för att öppna sidan i din webbläsare.

source: Please select the folder containing your music library, then click Choose.
mt: Välj mappen som innehåller ditt musik bibliotek, och klicka Välj.

source: Invalid port number
mt: Felaktigt port nummer

source: Browse...
mt: Välj mapp...

source: Library Location:
mt: Bibliotekets mappen:

source: Checking Firefly status‚Ä¶
mt: Kontrollerar Firefly's status‚Ä¶

source: The log file has not been created.
mt: Loggfilen har inte skapats.

source: Missing library name
mt: Saknar bibliotekets namn

source: An unexpected error occurred when trying to get the status of the Firefly server. Please close and re-open this Preference pane, and try again.
mt: Ett oväntat fel har uppstått när Firefly’s status kontrollerades. Starta om den här panelen för att försöka igen.

source: Unable to find or create Application Support folder
mt: Kunde inte hitta eller skapa Application Support mappen

source: Please enter a library name
mt: Skriv in bibliotekets namn

source: Due to an unexpected error, your changes could not be applied.
mt: Ett oväntat fel gjorde att dina ändringar inte kunde sparas.

source: Firefly status is unknown
mt: Fireflys status är okänd

source: Apply Now
mt: Använd

source: An unexpected error occurred when trying to stop Firefly. Please close and re-open this Preference pane, and try again.
mt: Ett oväntat fel uppstod när Firefly skulle stoppas. Starta om den här panelen för att försöka igen.

source: Start server:
mt: Starta servern:

source: Unable to stop Firefly
mt: Kunde inte stoppa Firefly

source: OtherViews
mt: Andra Vyer

source: Library directory could not be found in user folder
mt: Biblioteksmappen kunde inte hittas i användar mappen

source: Invalid value
mt: Ogiltigt värde

source: Please enter a password, or un-check the password checkbox
mt: Ange ett lösenord eller kryssa ur lösenords rutan

source: Configuration error
mt: Konfigurations fel

source: Communication has been lost with the Firefly Helper. Please close and re-open this Preference pane, and try again.
mt: Kontakten med Firefly Helper har förlorats. Starta om den här panelen för att försöka igen.

source: Don't Apply
mt: Aktivera Inte

source: Firefly is running
mt: Firefly är inte aktivt

source: The Firefly installation appears to be damaged. Unable to locate Firefly Helper.
mt: Installationen av Firefly verkar vara skadad. Kan inte lokalisera Firefly Helper.

source: General
mt: Allmänt

source: Advanced
mt: Avancerat

source: Lost contact with Firefly Helper
mt: Förlorade kontakten med Firefly Helper

source: Manually
mt: Manuellt

source: Firefly appears to be incorrectly installed or damaged. Please consult the documentation.
mt: Firefly verkar vara felaktig installerat eller skadat. Se dokumentationen för mer information.

source: An unexpected error occurred when trying to start Firefly. Please close and re-open this Preference pane, and try again.
mt: Ett oväntat fel uppstod när Firefly startades. Starta om den här panelen för att försöka igen.

source: Firefly is starting
mt: Firefly startar

source: Failed to save changes
mt: Kunde inte spara ändringarna

source: Choose Library Location
mt: Välj din biblioteketsmapp

source: Unable to get server status
mt: Kunde inte få serverns status

source: Automatically, when I log in
mt: Automatiskt, när jag loggar in

source: The configuration file is present, but is not writable: %@
mt: Konfigurations filen existerar, men går inte att skriva till: %@

source: The Firefly music server shares your music library with other computers and compatible devices on the local network.
mt: Firefly delar ditt musikbibliotek med andra datorer och kompatibla enheter på det lokala nätverket.

source: Stop Firefly
mt: Stoppa Firefly

source: Start Firefly
mt: Starta Firefly

source: Assign Server Port:
mt: Ange Serverns Port:

source: The log file is empty.
mt: Logg filen är tom.

source: Log
mt: Logg

source: Firefly could not be started because your changes could not be saved
mt: Firefly kunde inte startas eftersom dina ändringar inte kunde sparas

source: Firefly failed to start
mt: Firefly kunde inte startas

source: Firefly is disabled
mt: Firefly är avaktiverat

source: <unknown>
mt: <okänd>

source: (available when Firefly is running)
mt: (tillgängligt när Firefly ar aktivt)

source: Apply
mt: Använd

source: Firefly directory could not be found or created at: %@
mt: Firefly mappen kunde inte hittas eller skapas i: %@

source: Unable to start Firefly
mt: Kunde inte starta Firefly

source: Additional configuration options are available from Firefly's built-in web page. Available when Firefly is running.
mt: Fler konfigurations alternativ är tillgängliga via Fireflys inbyggde webb sida. Tillgängligt när Firefly är aktivt.

source: Firefly stopped unexpectedly
mt: Firefly stannade oväntat

source: Automatically
mt: Automatiskt

source: Choose
mt: Välj

source: Apply configuration changes?
mt: Använd konfigurations ändringarna?

source: Require Password:
mt: Lösenord som krävs:

source: %@'s Firefly on %@
mt: %1$@'s Firefly på %2$@

source: NSHumanReadableCopyright
mt: ¬© 2006 Roku LLC
